[
  {
    "id": "wpa_1930s",
    "label": "1930s WPA",
    "description": "Create a 1930s WPA / New Deal public-works poster with a bold tabloid banner headline layout. Flat graphic illustration (NOT photorealistic), chunky simplified shapes, strong geometry, big negative space, and a hand-printed screenprint/letterpress feel. Visible print texture: light misregistration, subtle halftone, worn paper grain, ink wear, and slightly rough edges.\n\nCOLOR / TYPE\n* Limited WPA palette: brick red, deep navy, cream/ivory (optional muted tan or forest green)\n* Bold block lettering + classic WPA sans/condensed type\n* Strong hierarchy: large headline banner + sturdy stacked callout blocks\n\nLAYOUT / GRAPHICS\n* Bold framing borders, poster panels, arches, simple rays, strong silhouettes\n* Broad flat color fields; minimal gradients\n* Composition feels civic, official, and “public notice”\n\nIMAGERY\nUse iconic civic-progress imagery matching the story (choose 1–3): bridge, dam, factory silhouette, courthouse/city hall, sunburst rays, laurel, torch, books, farm fields, gears, handshake. Keep it emblematic, hopeful, and non-violent."
  },
  {
    "id": "mid_century_modern",
    "label": "1950s-60s Mid-Century Modern",
    "description": "Create a 1950s–1960s mid-century modern tabloid-style poster with a bold banner headline layout. Flat, clean vector-like illustration (NOT photorealistic) with crisp edges, simple geometric forms, playful asymmetry, and lots of negative space. Add light paper grain and a subtle print feel (cleaner than pulp; minimal distress).\n\nCOLOR / TYPE\n* Limited mid-century palette (3–5 colors): teal, mustard, coral/orange-red, navy, cream\n* Bold sans-serif / condensed headline type with mid-century spacing\n* Clear hierarchy: big banner headline + secondary callouts in rounded blocks/badges\n\nLAYOUT / GRAPHICS\n* Rounded rectangles, boomerang shapes, atomic starbursts, sunburst rays, thin divider lines\n* Clean grid with retro flair; playful angled blocks\n* Minimal texture; smooth flat fills preferred\n\nIMAGERY\nUse upbeat mid-century symbolic imagery matching the story (choose 1–3): skyline, courthouse columns, telescope/satellite, factory silhouette, handshake, megaphone, simplified people silhouettes, charts/icons. Keep it optimistic, graphic, and non-violent."
  },
  {
    "id": "psychedelic_70s_tabloid",
    "label": "1970s Psychedelic Tabloid",
    "description": "Create a 1970s psychedelic concert-poster-meets-tabloid front page with a bold banner headline layout. Flat graphic illustration (NOT photorealistic) with swirling liquid shapes, wavy borders, high-energy optical patterns, and playful asymmetry. Feel like a sensational supermarket tabloid redesigned as a trippy 1970s poster.\n\nCOLOR / TYPE\n* Limited psychedelic palette (4–6 colors): hot orange, magenta, electric purple, teal, lemon yellow, deep navy/black\n* Headline lettering should be chunky and highly readable (avoid illegible warped typography)\n* Secondary callouts in starbursts / bubbles / rounded blobs with thick outlines\n\nLAYOUT / GRAPHICS\n* Huge top banner headline dominates (classic tabloid hierarchy)\n* Use wavy frames, liquid drips, concentric rings, paisley-like swirls, and radiating “vibration” lines\n* Add thick psychedelic borders and poster-like corner ornaments\n* Keep callouts big and simple; avoid tiny text\n* Keep all text inside safe margins; no text touching edges\n\nIMAGERY\nUse symbolic 70s psychedelic imagery matching the story (choose 1–3): stylized sunburst, dreamy skyline, abstract faces, cosmic shapes, mushrooms/cloud puffs (non-drug literal), hypnotic spirals, funky arrows, retro TV silhouette. Keep it playful and surreal, but still poster-clean.\n\nPRINT / TEXTURE RULES\n* Light poster paper grain; optional subtle screenprint texture\n* No photorealism, no gritty newspaper halftone (keep it more poster than pulp)\n* Strong contrast and bold shapes that fill the canvas (avoid huge empty margins)\n"
  },
  {
    "id": "neon_noir_vhs_80s",
    "label": "1980s Neon Noir / VHS",
    "description": "Create an 1980s neon-noir tabloid poster with a bold banner headline layout, like a late-night TV news scandal reimagined as a VHS-era thriller cover. Stylized illustration (NOT photorealistic) with dramatic shadows, neon rim-lighting, sharp silhouettes, and cinematic framing.\n\nCOLOR / TYPE\n* Limited neon noir palette (3–5 colors): deep black/navy, neon magenta, neon cyan, violet, and white highlights\n* Bold condensed sans-serif headline type (high readability) with 80s spacing\n* Secondary callouts as sharp boxes, slanted labels, or neon-glow badges\n\nLAYOUT / GRAPHICS\n* Top banner headline dominates; strong tabloid hierarchy\n* Use noir framing: heavy vignettes, angled shadows, high-contrast blocks\n* Add VHS design cues: scanlines, tape noise, subtle chromatic aberration, timestamp-like UI bars (NO extra readable text)\n* Use geometric neon frames, grid horizons, and “city at night” silhouettes\n* Keep all text inside safe margins; no text touching edges\n\nIMAGERY\nUse symbolic neon-noir imagery matching the story (choose 1–3): nighttime skyline, streetlight cone, detective-board pins/lines, paper/document silhouette, microphone, courthouse columns, CRT TV, retro computer terminal, glowing signs. Keep it emblematic and graphic.\n\nTEXTURE / RENDERING RULES\n* Add subtle VHS scanlines + light tape noise (not heavy static)\n* Neon glow should be controlled—crisp edges, not blurry fog everywhere\n* Fill the canvas with strong composition; avoid oversized empty borders/margins\n* No photorealism, no excessive tiny details\n"
  },
  {
    "id": "1990s_magazine_cutout_collage",
    "label": "1990s Magazine Cutout Collage",
    "description": "Create a 1990s magazine cutout collage tabloid poster with a bold banner headline layout. Looks like a zine made from scissors + glue: ripped paper edges, pasted photos, ransom-note style typography, marker scribbles, and taped overlays. Collage aesthetic (NOT photorealistic), but clean enough to read.\n\nCOLOR / TYPE\n* Saturated 90s palette with CMYK print feel: bright cyan/magenta/yellow plus black; optional neon accents\n* Mix typography styles: ransom-note letter cutouts + bold tabloid headline sans\n* Secondary callouts as sticker labels, torn captions, and highlight marker bars\n\nLAYOUT / GRAPHICS\n* Huge top banner headline as a pasted strip (torn edge) across the top\n* 2–5 collage elements: ripped photo shapes, layered rectangles, angled tape pieces\n* Drop shadows from paper layers (subtle), uneven alignment, imperfect cutouts\n* Optional doodles: arrows, circles, underlines, X marks (texture-only, no extra readable words)\n* Keep required text inside safe margins; avoid covering it with collage elements\n\nIMAGERY\nUse symbolic collage imagery matching the story (choose 1–3): cutout skyline, courthouse photo fragment, microphone clipping, document scraps, headline snippets as abstract texture blocks (no extra readable text).\n\nPRINT / TEXTURE RULES\n* Visible paper fibers, glue smears, tape gloss, photocopy grain\n* Slightly imperfect color registration and magazine print dot texture\n* Fill the canvas with layered pieces so it doesn’t feel like big blank borders"
  },
  {
    "id": "3026_futureverse",
    "label": "3026 - Futureverse",
    "description": "Create a retro-futuristic adult animated sci-fi sitcom style satirical retro-futuristic 2D cartoon news poster with clean, bold linework and flat cel-shading.  Characters have slightly oversized heads, big white oval eyes with small pupils, simple geometric noses, and bold elastic mouth shapes for expressive reactions. Keep details simplified and graphic (hair as solid shapes, clothing as iconic silhouettes). Minimal facial lines; emphasize silhouette and readability over realism.\n\nThe composition should feel like a comedic sci-fi city-world: a stylized futuristic skyline, hover traffic, neon signage,  robots, space aliens with odd faces.  and simplified tech props. Use rounded skyscrapers, antenna spires, neon panels, hover-cars, robots where appropriate \n\nUse a limited, punchy palette (teal/cyan, magenta, purple, warm orange highlights) with strong contrast and crisp edges. Add subtle halftone/print grain so it feels like a printed poster, not photorealistic. No gradients\n\nCOMPOSITION:\n- Huge, blocky tabloid headline at the top in a bold, slightly wonky sans-serif font.\n- Framing: Use thick black borders and rounded-corner callout boxes.\n- Art must look like a hand-painted animation cel over a simple gouache background."
  },
  {
    "id": "art_deco",
    "label": "Art Deco",
    "description": "Create a vintage Art Deco tabloid-style propaganda poster with a bold banner headline layout. Stylized illustration (NOT photorealistic) with geometric symmetry, stepped shapes, sunburst/radiating lines, strong vertical framing, and big negative space. Add a distressed letterpress/screenprint feel: subtle halftone, light ink bleed, grit, and aged paper texture.\n\nCOLOR / TYPE\n* Limited palette: red / black / sepia / cream (optionally a muted gold accent)\n* Bold condensed headline type + Art Deco display lettering for emphasis\n* Strong hierarchy: massive top banner, stacked callouts in framed boxes\n\nLAYOUT / GRAPHICS\n* Tabloid banner dominance at the top\n* Deco borders, stepped frames, chevrons, corner ornaments, rays, geometric badges\n* Minimal stars/stripes accents allowed, but keep it Deco-era (not modern)\n\nIMAGERY\nUse symbolic pulp-news imagery matching the story (choose 1–3): city skyline, courthouse silhouette, spotlight beam, radio tower, industrial geometry, bold silhouettes, dramatic rays, abstract “breaking news” energy."
  },
  {
    "id": "bw_manga_screentone_moe",
    "label": "B&W Manga Screentone",
    "description": "Create a black-and-white manga illustration with a cute “moe” character design. Clean, crisp line art (NOT photorealistic), simple youthful proportions, big round eyes, small nose/mouth, and tidy hair strands. Use classic printed-manga shading: screentone / halftone dot textures for skies and gradients, with minimal grayscale fills. High contrast overall with strong whites and deep blacks.\n\nSHADING / TEXTURE\n* Screentone dots and light hatch shading (printed manga feel)\n* Minimal soft gradients only (neck/cheeks), mostly flat tones\n* Avoid painterly rendering, avoid heavy realism\n\nBACKGROUND\n* High-contrast posterized foliage/background (photo-threshold look) or simple silhouetted shapes\n* Keep the character clean and readable against the background\n\nCOMPOSITION\n* Centered portrait / manga panel framing\n* Big negative space and clear silhouette\n"
  },
  {
    "id": "blueprint_technical_diagram_poster",
    "label": "Blueprints / Technical Diagram Poster",
    "description": "Create a blueprint / technical diagram style tabloid poster with a bold banner headline layout. Looks like an engineering drafting sheet meets a newspaper extra edition. Line-based schematic illustration (NOT photorealistic) with precise strokes, measurement-like marks, diagram callouts, and clean technical framing.\n\nCOLOR / TYPE\n* Blueprint palette: deep blueprint blue (or charcoal/black) with white/cream linework; optional one accent color for highlights\n* Technical sans-serif typography for labels and callouts (very readable)\n* Strong hierarchy: big top banner headline + 2–4 diagram callout blocks\n\nLAYOUT / GRAPHICS\n* Use drafting borders, title block area, grid lines, and diagram frames\n* Include schematic arrows, leader lines, numbered callouts, cross-section style boxes\n* Add subtle dotted/dashed construction lines and alignment guides\n* Keep all text inside safe margins; no text touching edges\n\nIMAGERY\nTranslate the story into technical symbols (choose 1–3): city skyline as wireframe outline, courthouse as elevation drawing, microphone as labeled component diagram, document as exploded-view sheet, chart as annotated plot. Everything should feel like a clean schematic.\n\nRENDERING / TEXTURE RULES\n* Crisp vector-like linework, consistent stroke weight\n* Minimal shading; rely on line density, hatching, and diagram conventions\n* Optional faint paper grain; avoid heavy grit or noisy textures\n* Fill the canvas with diagram content; avoid oversized blank borders"
  },
  {
    "id": "brutalist_poster",
    "label": "Brutalist Poster",
    "description": "Create a brutalist graphic design poster with a bold tabloid banner layout. Harsh typography, raw blocks, stark contrasts, and a distressed photocopy/zine feel. Imperfect edges, tape marks, rough textures, and bold typographic weight.\n\nKEYWORDS\n* brutalist graphic design, stark blocks, rough texture, photocopy, bold type\n\nVISUAL NOTES\n* Strong black/white with one accent color optional\n* Collage-like blocks; aggressive hierarchy; minimal symbolic imagery"
  },
  {
    "id": "cats",
    "label": "Cats",
    "description": "A tabloid-style poster in BLACK AND WHITE only. 1970s cartoon newspaper-comic aesthetic with bold ink lines, chunky outlines, halftone dots, light paper grain, and big rounded speech-bubble/caption shapes.\n\nIMAGERY (CATS-AS-HUMANS):\n- ALL characters must be anthropomorphic cartoon cats (humans look like cats).\nIMPORTANT: Replace a headline, callout, or slogan verb with meow or meowing or meowed"
  },
  {
    "id": "charcoal",
    "label": "Charcoal",
    "description": "Create a charcoal drawing poster (NOT photorealistic) with a bold tabloid banner layout. Dramatic shadows and heavy contrast: gritty charcoal texture, dusty smears, smudged edges, soft gradients, and a subtle vignette. Off-white paper with visible grain.\n\nKEYWORDS\n* charcoal drawing, heavy contrast, dusty texture, smudged edges, vignette\n\nVISUAL NOTES\n* Big headline banner; moody central scene; callouts in rough charcoal blocks\n* Strong light/dark shapes; expressive, gritty editorial feel"
  },
  {
    "id": "ink_and_wash",
    "label": "Ink & Wash",
    "description": "Create an ink-and-wash illustration poster (NOT photorealistic) with a bold banner headline layout. Black ink linework with gray watercolor/brush washes: loose expressive lines, varied line weight, soft wash gradients, and paper texture. Editorial newspaper illustration vibe.\n\nKEYWORDS\n* ink drawing, brush wash, watercolor gray tones, loose linework, paper texture\n\nVISUAL NOTES\n* Crisp headline banner; illustration built from ink contour + wash shadows\n* Keep shapes simple and symbolic; no gore, no weapons"
  },
  {
    "id": "japanese_anime",
    "label": "Japanese Anime-ish",
    "description": "Professional 2D Japanese anime key visual, tabloid poster style. Crisp cel-shaded digital illustration (NOT photorealistic) with bold, clean inked line art and hard-edge shadows. Style inspired by modern thriller and cyberpunk anime (Studio MAPPA or Madhouse).\n\nCOLOR / TYPE\n* Limited 4-color palette (Deep Navy, Stark White, Slate Grey) with one piercing neon accent (Red/Cyan/Yellow)\n* Bold Japanese-style typography banners; secondary callouts in starburst badges and UI elements\n* High contrast; flat 2D fills with no 3D gradients\n\nLAYOUT / GRAPHICS\n* Dynamic diagonal composition with strong silhouettes and heavy use of negative space\n* Oversized top banner headline; use of speed lines, panel framing, and graphic textures\n* Minimalist graphic design; optional subtle vintage paper grain only\n\nIMAGERY\nUse anime-style symbolic imagery (choose 1–3): city skyline, courthouse silhouette, spotlight beam, microphone, document, chart, handshake, medical icon, tech chip, etc. "
  },
  {
    "id": "japanese_anime_ish_v2",
    "label": "Japanese Anime-ish v2",
    "description": "Create an image of the following in a Japanese light novel cover illustration style, anime key visual composition, soft painterly watercolor rendering, clean thin lineart, bright pastel colors, gentle sunlight and bloom, smooth gradient shading, subtle paper texture, crisp facial features and expressive eyes, high detail background with atmospheric perspective, polished commercial illustration, sharp focus, no heavy outlines, no photorealism."
  },
  {
    "id": "kids_marker_drawing",
    "label": "Kids Marker Drawing",
    "description": "Create a childlike magic-marker drawing poster (NOT photorealistic) with a big banner headline layout. Uneven hand-drawn lines, doodly shapes, bright marker fills, messy coloring outside the lines, and visible paper texture. Playful, simple, and charming.\n\nKEYWORDS\n* childlike marker drawing, uneven lines, bright fills, doodles, paper texture\n\nVISUAL NOTES\n* Headline in big blocky kid lettering; callouts as sticker-like blobs\n* Keep everything friendly and non-violent"
  },
  {
    "id": "linocut_woodcut",
    "label": "Linocut / Woodcut",
    "description": "Create a linocut/woodcut print-style poster (NOT photorealistic) with a bold banner headline layout. High-contrast handmade print look: carved textures, chunky cut lines, rough edges, and bold silhouettes. Limited palette (black/cream, or 2–3 inks max). Strong geometric framing and poster hierarchy.\n\nKEYWORDS\n* linocut, woodcut print, carved lines, rough texture, bold silhouettes\n\nVISUAL NOTES\n* Headline banner + blocky callouts\n* Use simplified symbolic forms; emphasize carved texture and negative space"
  },
  {
    "id": "low_poly_paper_craft_diorama",
    "label": "Low-Poly / Paper Craft Diorama",
    "description": "Create a low-poly / paper-craft diorama tabloid poster with a bold banner headline layout. Everything looks like folded cardstock: faceted shapes, crisp edges, layered cut-paper depth, and soft studio lighting. Stylized 3D paper model look (NOT photorealistic).\n\nCOLOR / TYPE\n* Limited, harmonious palette (4–7 colors) with matte paper tones; optional one bright accent\n* Clean, modern sans-serif headline type; secondary callouts in paper labels/tags\n* High readability; keep all text inside safe margins and on flat paper panels\n\nLAYOUT / GRAPHICS\n* Big top banner headline as a folded paper strip or hanging sign\n* Central scene as a tabletop diorama with 2–4 layered planes (foreground/mid/background)\n* Use faceted low-poly geometry + cut-paper silhouettes; avoid tiny detail\n* Add depth with shadows between layers; keep composition poster-clean\n\nIMAGERY\nConvert the story into paper icons (choose 1–3): courthouse as folded cardstock facade, city skyline as layered cutout, microphone as a faceted paper prop, document as a folded sheet, chart as raised paper bars. Keep it emblematic and readable from a distance.\n\nRENDERING / TEXTURE RULES\n* Matte paper texture, subtle fiber grain, crisp fold lines, clean cut edges\n* Soft directional light with gentle shadows (no glossy plastic look)\n* Fill the canvas—avoid huge blank margins; scale the diorama to occupy most of the frame"
  },
  {
    "id": "mad_magazine",
    "label": "Mad Magazine",
    "description": "Create a satirical editorial-cartoon tabloid poster with a bold banner headline layout, inspired by classic Mad Magazine humor. Exaggerated caricature (NOT photorealistic): big expressive faces, overstated gestures, rubbery anatomy, and punchy comedic timing. Composition should feel busy-but-structured: lots of visual jokes and small gag details, but still a clean poster hierarchy with clear negative space around the headline and callouts.\n\nCOLOR / TYPE\n* Flat print colors (limited 5–8 color palette), clean fills, minimal shading\n* Thick, confident ink outlines; slight print texture optional (very light)\n* Bold, readable headline lettering; secondary callouts in comic caption boxes or bursts\n* Strong hierarchy: huge top banner headline + 2–4 chunky callout blocks\n\nLAYOUT / GRAPHICS\n* Tabloid banner dominance at the top\n* Busy scene below the banner with organized zones (foreground gag, midground gag, background gag)\n* Use speech bubbles and caption boxes as shapes (NO extra readable text beyond required)\n* Include slapstick symbols and visual metaphors (choose 2–4): banana peel, pie-in-face, spring boxing glove, whoopee cushion, rubber chicken, oversized mallet, exploding confetti, comic sweat drops, “idea” lightbulb icon, broken sign, tilted stack of papers\n* Keep all required text inside safe margins; nothing touching edges\n\nIMAGERY\nUse exaggerated, comedic caricature imagery matching the story (choose 1–3 main actors): a smug official, frazzled worker, chaotic reporter, confused citizen, or scheming exec. Add 3–6 small background gags that reinforce the story’s theme (tiny props, signs-as-shapes, ironic details, visual puns). Keep it playful, mischievous, and non-violent.\n\nRENDERING RULES\n* NOT photorealistic; clean cartoon linework only\n* Flat colors, minimal gradients, minimal texture\n* Prioritize readability and poster hierarchy over clutter: busy details should stay secondary to the main headline and central figure\n"
  },
  {
    "id": "newspaper_comic_strip",
    "label": "Newspaper Comic Strip",
    "description": "Create a newspaper comic strip-style poster (NOT photorealistic) with a tabloid banner headline layout. Simplified characters, heavy outlines, clean shapes, and minimal shading. Flat color or limited tones, clear readable composition, and playful editorial-cartoon energy.\n\nKEYWORDS\n* comic strip style, thick outlines, flat fills, simple shading, clean shapes\n\nVISUAL NOTES\n* Bold banner headline; callouts as caption boxes or speech-bubble-like badges (no extra text beyond required)\n* Friendly satire vibe;"
  },
  {
    "id": "newspaper_editorial",
    "label": "Newspaper Editorial",
    "description": "Create a black-and-white editorial newspaper-style poster. Clean broadsheet layout with strong typographic hierarchy, lots of white space, thin horizontal rules, and subtle paper grain. No color. our key-phrase callout boxes arranged in a neat 2x2 grid.\n- Each box has a thin black border, generous padding, and ALL-CAPS condensed serif/sans text.\n- Keep alignment perfectly consistent and margins even.\n\nBOTTOM SECTION:\n- A detailed pen-and-ink / etching-style sketch illustration (crosshatching + stippling) of an urban streetscape with recognizable-but-generic buildings and small groups of people.\n- Include a sense of “news scene” tension through composition only (no gore, no explicit violence, no graphic content).\n- The illustration should feel like a classic newspaper courtroom/editorial sketch."
  },
  {
    "id": "pencil_sketch_graphite",
    "label": "Pencil Sketch / Graphite",
    "description": "Create a hand-drawn graphite pencil sketch poster (NOT photorealistic) with a bold tabloid banner layout. Black-and-white monochrome on off-white paper: visible pencil strokes, cross-hatching, shading, smudges, light eraser marks, and paper tooth. Strong framing, clean readable shapes, big negative space. NO halftone dots, NO screenprint textures, NO color.\n\nKEYWORDS\n* graphite pencil sketch, crosshatching, smudged shading, off-white paper, no color\n\nVISUAL NOTES\n* Heavy outlined banner at top; callouts in pencil-outlined blocks\n* Emphasize draftsmanship, sketch energy, and tonal contrast"
  },
  {
    "id": "retro_futurism",
    "label": "Retro Futurism",
    "description": "Create a retro-futurist tabloid-style poster (NOT photorealistic) with bold banner headline hierarchy. Optimistic atomic-age tech vibe: rockets, rays, simplified machines, and clean geometric forms. Flat illustration, high contrast, and a mid-century science-poster energy.\n\nKEYWORDS\n* retro futurism, atomic age, rays, rockets, simplified tech icons\n\nVISUAL NOTES\n* Banner headline at top; callouts as starbursts or tech badges\n* Use symbolic tech/city imagery; keep it upbeat and non-violent"
  },
  {
    "id": "risograph",
    "label": "Risograph",
    "description": "Create a risograph zine-style poster (NOT photorealistic) with a bold tabloid banner headline layout. Limited inks (2–4 colors max) with visible grainy dots, misregistration, and ink overlap. Flat graphic shapes, bold type, and a DIY print-shop vibe on slightly textured paper.\n\nKEYWORDS\n* risograph print, misregistration, grainy ink, limited colors, zine poster\n\nVISUAL NOTES\n* Bright but limited palette; imperfect alignment; speckled ink texture\n* Strong hierarchy; keep imagery symbolic and punchy"
  },
  {
    "id": "rubber_stamp_bureaucratic_file",
    "label": "Rubber Stamp / Bureaucratic File",
    "description": "Create a bureaucratic case-file / rubber-stamp tabloid poster with a bold banner headline layout. Design it like an over-processed government dossier: stamped approvals/denials, redactions, form boxes, paperclips, file labels, and photocopy artifacts. Graphic, flat, and print-forward (NOT photorealistic).\n\nCOLOR / TYPE\n* Limited palette: off-white/aged paper, black ink, and 1–2 stamp inks (red + optional blue/green)\n* Typewriter + official sans-serif mix (forms + headers); headline is bold condensed sans\n* High legibility; keep all required text clean and centered in safe margins\n\nLAYOUT / GRAPHICS\n* Massive top banner headline like a file header strip\n* Secondary callouts as form fields, checkboxes, and stamped rectangles\n* Add rubber stamp graphics: APPROVED / REJECTED / FILED / CONFIDENTIAL / URGENT (as texture-only elements)\n* Use black redaction bars and censored blocks (do NOT add extra readable words)\n* Include dossier UI: document corners, punched holes, binder rings, paperclip/tape marks\n\nIMAGERY\nUse symbolic office/bureaucracy imagery matching the story (choose 1–3): manila folder silhouette, courthouse seal icon, rubber stamp in motion, official forms, paper stack, ID badge outline. Keep it simple and emblematic.\n\nPRINT / TEXTURE RULES\n* Photocopier noise, slight skew, faint scan lines, toner grit, uneven ink pressure\n* Slight misregistration for stamps, imperfect edges, distressed paper grain\n* Fill the page with forms/stamps so it doesn’t look like big empty margins"
  },
  {
    "id": "soviet_constructivist",
    "label": "Soviet Constructivist",
    "description": "Create a 1920s–1930s Soviet Constructivist propaganda poster with a tabloid banner headline layout. Flat graphic illustration (NOT photorealistic), hard-edged geometric shapes, diagonal energy, bold asymmetry, and strong negative space. Add distressed print texture: slight misregistration, subtle halftone, ink grit, and aged paper.\n\nCOLOR / TYPE\n* Limited constructivist palette: red / black / cream (optional muted gray)\n* Bold condensed sans-serif + blocky stencil/letterpress feel\n* Strong hierarchy: headline dominates; secondary callouts in angled bars\n\nLAYOUT / GRAPHICS\n* Diagonal banners, wedges, circles/rays, chevrons, sharp frames\n* Dynamic composition with strong directional lines\n* Minimal extra ornament; keep it poster-forward and graphic\n\nIMAGERY\nUse symbolic, emblem-like imagery matching the story (choose 1–3): megaphone, factory silhouette, gears, courthouse columns, city skyline, protest sign, telescope, starburst rays."
  },
  {
    "id": "storybook_illustration",
    "label": "Storybook Illustration",
    "description": "Create a warm storybook illustration poster (NOT photorealistic) with a bold banner headline layout. Soft painterly feel, gentle shading, warm tones, and friendly whimsical composition. Hand-painted texture on paper, simplified forms, and inviting atmosphere.\n\nKEYWORDS\n* storybook illustration, hand-painted feel, soft shading, whimsical composition\n\nVISUAL NOTES\n* Clear hierarchy with banner headline; callouts as friendly signboards/badges\n* Keep details symbolic and approachable"
  },
  {
    "id": "swiss_typographic",
    "label": "Swiss / International Typographic Style",
    "description": "Create a Swiss/International Typographic Style poster with a strict grid and tabloid headline hierarchy. Minimal illustration (if any), clean geometry, strong alignment, and lots of negative space. Crisp sans-serif typography, clear information blocks, and disciplined layout.\n\nKEYWORDS\n* Swiss design, grid layout, minimal, sans-serif typography, clean geometry\n\nVISUAL NOTES\n* Banner headline is clean and structured, not distressed\n* Callouts as modular grid blocks; imagery reduced to simple icons/shapes"
  },
  {
    "id": "simpsons_like",
    "label": "The Simpsons-ish",
    "description": "Create a bright, satirical 2D cartoon tabloid poster with a bold banner headline layout, inspired by a classic American prime-time animated sitcom like The Simpsons. Use simple rounded shapes, thick clean black outlines, flat cel colors, minimal shading, and expressive faces. Keep it playful, punchy, and poster-like (NOT photorealistic), with strong framing and big negative space.\n\nCHARACTERS / STYLE\n* Warm yellow skin tones for characters\n* Large white eyes with small black pupils\n* Overbite smiles, simple noses, simplified hands\n* Slightly exaggerated expressions and poses\n* Clean vector-like linework, consistent outline thickness\n\nCOLOR PALETTE:\n* Skin Tones: Use strictly 'Simpsons Yellow' (#FFD90F)\n* Backgrounds: Use high-saturation 'Marge Blue' (#0047BB) and 'Lard Lad Pink' (#F191BA)\n* Flat cel shading with minimal soft gradients\n* Bold, clean sans-serif headline lettering (cartoon poster style)\n* High readability; avoid tiny text\n* Minimal background detail; simple shapes and silhouettes\n* Strong hierarchy: huge top banner + chunky callout blocks\n\nLAYOUT / GRAPHICS\n* Top banner headline dominates\n* Big rounded rectangles for callouts, simple icon badges\n* Optional simple flat gradient sky, but avoid painterly rendering\n\nRENDERING RULES\n* Thick outlines, flat cel shading, minimal gradients\n* No halftone dots, no screenprint grit, no realistic textures\n* Funny-but-serious, tabloid-news themed composition\n\nLOCATIONS\n* Include iconic Springfield locations if possible (e.g., Kwik-E-Mart, couch in living room, Nuclear Power Plant)\n"
  },
  {
    "id": "ukiyo_e_newspaper_extra",
    "label": "Ukiyo-e Newspaper Extra",
    "description": "Create a Japanese Ukiyo-e woodblock-print inspired tabloid front-page poster with a bold banner headline layout. Flat graphic illustration (NOT photorealistic) with carved-outline linework, simplified shapes, and elegant negative space. Use traditional woodblock aesthetics: visible paper fiber, subtle ink bleed, slight registration offset, and gentle texture. Composition should feel like an old newspaper extra edition reimagined as Edo-era print design.\n\nCOLOR / TYPE\n* Limited Ukiyo-e palette (3–5 colors): indigo, vermilion red, warm tan, charcoal, cream/ivory\n* Headline lettering should feel like bold brush-calligraphy or blocky woodblock title cards (high legibility)\n* Strong hierarchy: massive top banner + 1–2 secondary callouts in framed cartouches\n\nLAYOUT / GRAPHICS\n* Tabloid banner dominance at the top with thick border framing\n* Use Ukiyo-e motifs as graphic devices: wave patterns, cloud swirls, textile patterns, decorative corner blocks\n* Use rectangular woodblock panels and inset frames like printed title placards\n* Keep all text inside safe margins; nothing touching edges\n\nIMAGERY\nUse symbolic Ukiyo-e style imagery matching the story (choose 1–3): stylized city skyline, bridge, lanterns, courtesan fan shapes, temple gate silhouette, dramatic sun disc, birds, boats, mountains, wind lines, waves. Keep forms iconic and simplified, like carved blocks.\n\nPRINT / TEXTURE RULES\n* Visible woodgrain / carved texture in large flat areas\n* Slight misregistration allowed (subtle), gentle ink bleed, paper grain\n* Avoid modern gradients, 3D lighting, or photoreal textures\n"
  },
  {
    "id": "vintage_tabloid_pulp_news",
    "label": "Vintage Tabloid / Pulp News",
    "description": "Create a vintage tabloid-style propaganda poster with loud banner headlines and sensational framing. Pulp news illustration vibe (NOT photorealistic): bold simplified shapes, strong geometric framing, big negative space, and gritty aged-paper texture. Distressed print look with visible ink wear, grit, light misregistration, and high contrast.\n\nKEYWORDS\n* tabloid banner layout, pulp news illustration, distressed print, aged paper, high contrast\n\nVISUAL NOTES\n* Headline dominates the top; stacked callouts in framed boxes\n* Strong silhouettes, dramatic angles, poster-like hierarchy\n*  keep it stylized"
  }
]